//
//  zodiacSigns.swift
//  Lecture 15
//
//  Created by Nika Kakhniashvili on 11.04.24.
//

import Foundation

struct ZodiacSign {
    let name: String
    let description: String
    let imageName: String
    let polarName: String
    let polarImageName: String
}

let zodiacSigns: [ZodiacSign] = [
        ZodiacSign(name: "ვერძი", description: "დაბადებულია მოგებისთვის, ძალიან აქტიური და კომუნიკაბელურია. არის თავმოყვარე, თავდაჯერებული, უშიშარი. მას მართავს გრძნობები, ჯერ აკეთებს და მერე ფიქრობს. იმპულსურია. გრძნობები უბინდავენ გონებას. ვნებიანი და ეგოისტია. ვერ იტანს, როცა რამეს უკრძალავენ. მათში ყველაფერი დიდი დოზითაა. ასევე ავანტიურისტია.", imageName: "aries", polarName: "სასწორი", polarImageName: "libra"),
        ZodiacSign(name: "კურო", description: "პრაქტიკული, რეალისტი, პრაგმატული, პესიმისტი, უყვართ და პატივს სცემენ სიმდიდრეს, მაგრამ ხემოჭერილები არიან, უფრთხილდებიან იმას, რაც აქვთ. იზიდავთ გართობა და სიამოვნება. უყვართ სახლი და ოჯახი. მესაკუთრეები და კარგი მშობლები არიან. ჯიუტები, ძლიერი სულის პატრონები და შრომისმოყვარეები არიან. არ აქვთ არასრულყოფილების კომპლექსი. სულის სიღრმეში თავი სამყაროს ღერძებად მიაჩნიათ.", imageName: "taurus", polarName: "მორიელი", polarImageName: "scorpio"),
        ZodiacSign(name: "ტყუპები", description: "ძალიან უყვართ ჭორების და ინფორმაციების შეგროვება. იციან ყველაფერი ყველაფერზე და მათ შეიძლება შეხვდეთ ყველგან. გონებამახვილი, ცოცხალი, კომუნიკაბელური, მჭერმეტყველი.. ეს ყველაფერი ტყუპებზეა ნათქვამი. მათთან არ მოიწყენ. მიისწრაფიან სრულყოფილებისკენ, რათა ყველას თავი მოაწონონ. ადვილად ეგუებიან ყველაფერს. აქვთ უამრავი იდეა... სჭირთ გაორება.", imageName: "gemini", polarName: "მშვილდოსანი", polarImageName: "sagittarius"),
        ZodiacSign(name: "კირჩხიბი", description: "რომანტიკული, გულიანი, უყვართ ბავშვები, ცხოველებიც. აქვთ მაღალი პასუხისმგებლობის გრძნობა. არიან დაკომპლექსებულები, ძალიან ეჭვიანები, თავგანწირულები, სენტიმენტალურები და კონსერვატორები. მესაკუთრეები, მგრძნობიარეები. აქვთ მდიდარი ფანტაზია და კარგი ინტუიცია.", imageName: "cancer", polarName: "თხის რქა", polarImageName: "capricorn"),
        ZodiacSign(name: "ლომი", description: "მამაცი, შეუპოვარი და გულუხვი. ცნობისმოყვარე, გავლენიანი, ცეცხლოვანი, უყვარს მართვა, საკუთარ თავზე შეყვარებული, ეგოცენტრიკი, პრესტიჟი მათთვის ყველაფერია, მიმზიდველი, არტისტული, მაგნიტური, დაბადებულია ლიდერად, რომანტიკული, ქარიზმატული, უყვართ ყურადღების ცენტრში ყოფნა და ხშირად იმსახურებენ კიდეც.", imageName: "leo", polarName: "მერწყული", polarImageName: "aquarius"),
        ZodiacSign(name: "ქალწული", description: "თავშეკავებული, პედანტური, ანალიტიკური გონება, კრიტიკოსი, ყურადღებას აქცევს წვრილმანებს, რაციონალური, გამოთვლილი და დაგეგმილი აქვს ყველაფერი. პრაქტიკოსი, მომთხოვნი, საღი გონების პატრონი.", imageName: "virgo", polarName: "თევზები", polarImageName: "pisces"),
        ZodiacSign(name: "სასწორი", description: "გაუბედავი, ჰარმონიული, პაცეფისტი, დამთმობი, გაურბის კონფლიქტეპს, დიპლომატი, არ უყვარს მარტოობა, ხშირად სისულელეებს აკეთებს, იდეალისტი, რომანტიკოსი, მიმზიდველი, უყვარს ხელოვნება, ახასიათებს მოუთმენლობა.", imageName: "libra", polarName: "ვერძი", polarImageName: "aries"),
        ZodiacSign(name: "მორიელი", description: "მიდრეკილია დაპყრობისკენ, მისი დევიზია ყველაფერი ან არაფერი, ვნებიანია, მოსწონს მისტიკა, არღვევს ტაბუებს, თავდაჯერებული და მესაკუთრეა. ჯიუტი, რისკიანი, ემოციური, მიმწოლი ხასიათისაა.", imageName: "scorpio", polarName: "კურო", polarImageName: "taurus"),
        ZodiacSign(name: "მშვილდოსანი", description: "პირდაპირი, სამართლიანი, აგრესიული ოპტიმისტი, უყვარს ძებნა და პოვნა, არ აქვს ზომიერების შეგრძნება, სულ მოძრაობს, ფარული სურვილი აქვს ფლობის, იმპულსურია.", imageName: "sagittarius", polarName: "ტყუპები", polarImageName: "gemini"),
        ZodiacSign(name: "თხის რქა", description: "ახასიათებს თავმოყვარეობა, სიმდიდრის სიყვარული, პრაგმატულობა, სიფრთხილე, ამბიციურობა, თავშეკავებულობა, დამოუკიდებლობა . მათთვის ძალიან მნიშვნელოვანია მატერიალური კეთილდღეობა და სტატუსი. არიან კარიერისტები და კონსერვატორები.", imageName: "capricorn", polarName: "კირჩხიბი", polarImageName: "cancer"),
        ZodiacSign(name: "მერწყული", description: "მერწყული: ორიგინალური, ალტრუისტი, იდეალისტი, იდეალური მებრძოლი, კომუნიკაბელური, თავისუფლების მოყვარული, ექსტრავაგანტული, უყვარს პუბლიკის შოკურ მდგომარეობამდე მიყვანა. არიან ინტელექტუალები, ვერ იტანენ რუტინულ ცხოვრებას.", imageName: "aquarius", polarName: "ლომი", polarImageName: "leo"),
        ZodiacSign(name: "თევზები", description: "მგრძნობიარე მეოცნებეები, მდიდარი ფანტაზია, მიმზიდველობა, შემოქმედებითი ხასიათი, არტისტიზმი, პასიურები, გაუბედავები, ფატალურები, რეფლექსურები, აქვთ კარგი ინტუიცია.", imageName: "pisces", polarName: "ქალწული", polarImageName: "virgo")
    ]

